tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# formulae
brew "git"
brew "nvm"

# casks
cask "amazon-q"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "termius"
cask "visual-studio-code"

# install vscode extensions
# function vscode() {
#   code --install-extension $1
# }

vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gitHub.copilot"
vscode "github.copilot-chat"
vscode "mikestead.dotenv"
vscode "ms-vsliveshare.vsliveshare"
vscode "tal7aouy.icons"
vscode "wakatime.vscode-wakatime"
